index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-07-16 Wed 14:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Forge (your system)</title>
<meta name="author" content="malloc-nbytes" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Forge (your system)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org4d37ff0">1. About</a></li>
<li><a href="#org47cd03c">2. Compiling</a></li>
<li><a href="#org4347d46">3. Getting Started</a>
<ul>
<li><a href="#orge90fede">3.1. Walkthrough adding a new project</a></li>
</ul>
</li>
<li><a href="#org5e18d85">4. Configuring <code>Forge</code></a></li>
<li><a href="#org617243a">5. API Reference</a>
<ul>
<li><a href="#org51b12cc">5.1. <code>forge/smap.h</code></a></li>
<li><a href="#org66164f6">5.2. <code>forge/arg.h</code></a></li>
<li><a href="#org7cd393f">5.3. <code>forge/rdln.h</code></a></li>
<li><a href="#orgf664a41">5.4. <code>forge/forge.h</code></a></li>
<li><a href="#org7fd2e2b">5.5. <code>forge/pkg.h</code></a></li>
<li><a href="#org0fb4f11">5.6. <code>forge/io.h</code></a></li>
<li><a href="#org5de112d">5.7. <code>forge/str.h</code></a></li>
<li><a href="#orgb729a57">5.8. <code>forge/cmd.h</code></a></li>
<li><a href="#org11f8ff0">5.9. <code>forge/colors.h</code></a></li>
<li><a href="#org648d3a6">5.10. <code>forge/mem.h</code></a></li>
<li><a href="#orgcff19a2">5.11. <code>forge/array.h</code></a></li>
<li><a href="#org018d7cb">5.12. <code>forge/ctrl.h</code></a></li>
<li><a href="#org0734417">5.13. <code>forge/viewer.h</code></a></li>
<li><a href="#orgb0b7012">5.14. <code>forge/conf.h</code></a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org4d37ff0" class="outline-2">
<h2 id="org4d37ff0"><span class="section-number-2">1.</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
Forge is a package manager where you "forge" your own packages in the form of C source files.
Every package that you want to install must have an associated C file that contains rules and functions on how to build, install, uninstall, etc.
To help with this, a suite of functions and data structures are supplied as the forge API.
</p>
</div>
</div>
<div id="outline-container-org47cd03c" class="outline-2">
<h2 id="org47cd03c"><span class="section-number-2">2.</span> Compiling</h2>
<div class="outline-text-2" id="text-2">
<p>
Forge requires sqlite3. You must either download and untar it yourself, or just run <code>./bootstrap.sh</code>.
Once this is done, run the following:
</p>

<div class="org-src-container">
<pre class="src src-bash">autoreconf --install
./configure --prefix=&lt;prefix&gt; --libdir=&lt;dir&gt;
make
</pre>
</div>

<ul class="org-ul">
<li>Where <code>&lt;prefix&gt;</code> is your preferred installation prefix for the binary i.e., <code>/usr</code>, <code>/usr/local</code>.</li>
<li>Where <code>&lt;libdir&gt;</code> is your preferred installation location for the forge library i.e., <code>/usr/lib64</code>, <code>/usr/local/lib</code>.</li>
</ul>

<p>
To install, run <code>sudo make install</code>. To uninstall, run <code>sudo make uninstall</code>.
</p>

<p>
Forge installs files to these locations:
</p>
<ul class="org-ul">
<li><code>&lt;prefix&gt;/forge</code> (binary)</li>
<li><code>&lt;prefix&gt;/include/forge</code> (API Headers)</li>
<li><code>&lt;dir&gt;/libforge.so</code> (forge library)</li>
<li><code>/var/lib/forge/forge.db</code> (forge database)</li>
<li><code>/var/cache/forge/sources/</code> (package sources)</li>
<li><code>/usr/src/forge/modules/</code> (C package modules)</li>
<li><code>/usr/lib/forge/modules</code> (compiled C package modules)</li>
</ul>
</div>
</div>
<div id="outline-container-org4347d46" class="outline-2">
<h2 id="org4347d46"><span class="section-number-2">3.</span> Getting Started</h2>
<div class="outline-text-2" id="text-3">
<p>
The first time you run <code>forge</code> must be as root. This sets up the database. All subsequent calls do not need it
(unless the action has an R tag, see <code>--help</code> for more information).
</p>

<p>
To begin creating a new package, run <code>sudo forge new &lt;pkg&gt;</code>. This will open an editor to start definining the
package rules and behavior. When you are finished, save and quit.
</p>

<p>
When new packages are added, they must be built with <code>sudo forge --rebuild</code>. This will compile them and show
any errors if needed.
</p>

<p>
If there are errors, you can run <code>sudo forge edit &lt;pkg&gt;</code> to start editing it again.
</p>

<p>
When all of your packages have been compiled, run <code>forge list</code> to see all available. You can then run the following to install them:
<code>sudo forge install &lt;pkg1&gt; &lt;pkg2&gt;, ..., &lt;pkgN&gt;</code>. If you want to remove them, run <code>sudo forge uninstall &lt;pkg1&gt; &lt;pkg2&gt;, ..., &lt;pkgN&gt;</code>.
If you want to update, do <code>sudo forge update &lt;pkg1&gt; &lt;pkg2&gt;, ..., &lt;pkgN&gt;</code> or have no arguments to update all of them.
</p>

<p>
You will notice that there are packages already available when doing <code>forge list</code>. These were downloaded from the <code>forge-modules</code> repository.
These cannot be edited, but can be updated by doing <code>forge --rebuild --sync</code> or <code>forge -rs</code>.
</p>
</div>
