index.org
** Walkthrough adding a new project

Here is an example of how to add a package.

I will add one of my packages called =AnimX=.

Start the module with `forge new malloc-nbytes@AnimX`. This will generate the following:

#+begin_src c
  #include <forge/forge.h>

  char *deps[] = {NULL}; // Must be NULL terminated

  char *getname(void) { return "author@pkg_name"; }
  char *getver(void) { return "1.0.0"; }
  char *getdesc(void) { return "My Description"; }
  char **getdeps(void) { return deps; }
  char *download(void) {
          return NULL; // should return the name of the final directory!
  }
  void build(void) {}
  void install(void) {}
  void uninstall(void) {}
  int update(void) {
          return 0; // return 1 if it needs a rebuild, 0 otherwise
  }
  void get_changes(void) {
          // Pull in changes if update() returns 1
  }

  FORGE_GLOBAL pkg package = {
          .name = getname,
          .ver = getver,
          .desc = getdesc,
          .deps = NULL,
          .download = download,
          .build = build,
          .install = install,
          .uninstall = uninstall,
          .update = forge_pkg_git_update, // or define your own if not using git

          // Make this NULL to just re-download the source code
          // or define your own if not using git
          .get_changes = forge_pkg_git_pull,
  };
#+end_src

Start filling out the missing fields. Also fill out how to build, install, uninstall, and (optionally) update.

#+begin_src c
  #include <forge/forge.h>

  char *getname(void) { return "malloc-nbytes@AnimX"; }
  char *getver(void) { return "1.0.0"; }
  char *getdesc(void) { return "Animated Wallpapers for X"; }
  char *download(void) {
          // This download() function must return the name
          // of the directory that gets downloaded. The result
          // of git_clone() will return "AnimX". You could also do:
          //  char *download(void) {
          //    cmd("git clone https://www.github.com/malloc-nbytes/AnimX.git");
          //    return "AnimX";
          //  }
          return git_clone("malloc-nbytes", "AnimX");
  }
  void build(void) {
          cmd("autoreconf --install");
          configure("./", NULL);
          make(NULL);
  }
  void install(void) {
          make("install");
  }
  void uninstall(void) {
          make("uninstall");
  }
  void get_changes(void) {
          // Pull in changes if update() returns 1
  }

  FORGE_GLOBAL pkg package = {
          .name = getname,
          .ver = getver,
          .desc = getdesc,
          .deps = NULL,
          .download = download,
          .build = build,
          .install = install,
          .uninstall = uninstall,
          .update = forge_pkg_git_update, // using default git update

          // Make this NULL to just re-download the source code
          // or define your own if not using git
          .get_changes = forge_pkg_git_pull,
  };
#+end_src

I have decided to get rid of the =update()= function because, since this is a =git= repo, we can use
the =forge_pkg_git_update()= provided by =forge/pkg.h= (included by =forge/forge.h=). If you were to
create your own =update()= function, it must return =1= if it should get the new changes and rebuild,
and =0= if otherwise.

If you do not know any of the other functions that are being used i.e., =cmd()=, =make()=, =configure()=,
run =forge apilist= and then =forge api <api_name>= to see documentation.

Once you are done with your package, call =forge --rebuild # or forge -r= to rebuild all
=C= modules. If there are any errors, they will be reported. If you need to fix anything,
do =forge edit <pkgname>=.

You should now see your new package available by running =forge list=. To get rid of it, run =forge drop <pkgname>=.
This will create a backup and you can use =forge restore <pkgname>= to get it back.

* Configuring =Forge=

The configuration file is compiled with =forge=, meaning that if you need to edit it, you must also
recompile to get the changes. You can edit it by doing =forge editconf=. Once your changes are done,
do =forge updateforge= (this requires an internet connection).

* API Reference

# ENDDOCS
** =forge/smap.h=
#+begin_src c
#ifndef FORGE_SMAP_H_INCLUDED
#define FORGE_SMAP_H_INCLUDED

#include <stddef.h>

#define FORGE_SMAP_DEFAULT_TBL_CAPACITY 2048

typedef struct __forge_smap_node {
        char *k; // owns the string
        void *v;
        struct __forge_smap_node *n;
} __forge_smap_node;

typedef struct {
        __forge_smap_node **tbl;
        size_t len; // number of table entries
        size_t cap; // capacity of table
        size_t sz; // how many total nodes
} forge_smap;

/**
 * Returns: a new string map
 * Description: Create a new string map. Make sure to
 *              call forge_smap_destroy() to free memory.
 */
forge_smap forge_smap_create(void);

/**
 * Parameter: map -> the map to insert to
 * Parameter: k   -> the key
 * Parameter: v   -> the value
 * Description: Insert key `k` with value `v` into the map `map`.
 */
void forge_smap_insert(forge_smap *map, const char *k, void *v);

/**
 * Parameter: map -> the map to query
 * Parameter: k   -> the key to check
 * Returns: 1 if found, 0 if otherwise
 * Description: See if the key `k` is inside of the map `map`.
 */
int forge_smap_contains(const forge_smap *map, const char *k);

/**
 * Parameter: map -> the map to get from
 * Parameter: k   -> the key with the associated value
 * Returns: the value of of the key `k`.
 * Description: Get the value that the key `k` is associated with.
 */
void *forge_smap_get(const forge_smap *map, const char *k);

/**
 * Parameter: map -> the map to destroy
 * Description: free()'s all memory that `map` allocates.
 */
void forge_smap_destroy(forge_smap *map);

/**
 * Parameter: map -> the map to iterate
 * Returns: an array of keys (NULL terminated, NULL on failure)
 * Description: Use this function to get all keys inside of
 *              the map. It is guaranteed to be NULL terminated.
 *              The result needs to be free()'d. The individual strings
 *              do not need to be free()'d.
 */
char **forge_smap_iter(const forge_smap *map);

/**
 * Paramter: map -> the map to get the size from
 * Returns: the number of nodes in the map
 * Description: Get the number of nodes stored inside of `map`.
 */
size_t forge_smap_size(const forge_smap *map);

#endif // FORGE_SMAP_H_INCLUDED


#+end_src
