index.html
<div id="outline-container-orge90fede" class="outline-3">
<h3 id="orge90fede"><span class="section-number-3">3.1.</span> Walkthrough adding a new project</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Here is an example of how to add a package.
</p>

<p>
I will add one of my packages called <code>AnimX</code>.
</p>

<p>
Start the module with `forge new malloc-nbytes@AnimX`. This will generate the following:
</p>

<div class="org-src-container">
<pre class="src src-c">#include &lt;forge/forge.h&gt;

char *deps[] = {NULL}; // Must be NULL terminated

char *getname(void) { return "author@pkg_name"; }
char *getver(void) { return "1.0.0"; }
char *getdesc(void) { return "My Description"; }
char **getdeps(void) { return deps; }
char *download(void) {
        return NULL; // should return the name of the final directory!
}
void build(void) {}
void install(void) {}
void uninstall(void) {}
int update(void) {
        return 0; // return 1 if it needs a rebuild, 0 otherwise
}
void get_changes(void) {
        // Pull in changes if update() returns 1
}

FORGE_GLOBAL pkg package = {
        .name = getname,
        .ver = getver,
        .desc = getdesc,
        .deps = NULL,
        .download = download,
        .build = build,
        .install = install,
        .uninstall = uninstall,
        .update = forge_pkg_git_update, // or define your own if not using git

        // Make this NULL to just re-download the source code
        // or define your own if not using git
        .get_changes = forge_pkg_git_pull,
};
</pre>
</div>

<p>
Start filling out the missing fields. Also fill out how to build, install, uninstall, and (optionally) update.
</p>

<div class="org-src-container">
<pre class="src src-c">#include &lt;forge/forge.h&gt;

char *getname(void) { return "malloc-nbytes@AnimX"; }
char *getver(void) { return "1.0.0"; }
char *getdesc(void) { return "Animated Wallpapers for X"; }
char *download(void) {
        // This download() function must return the name
        // of the directory that gets downloaded. The result
        // of git_clone() will return "AnimX". You could also do:
        //  char *download(void) {
        //    cmd("git clone https://www.github.com/malloc-nbytes/AnimX.git");
        //    return "AnimX";
        //  }
        return git_clone("malloc-nbytes", "AnimX");
}
void build(void) {
        cmd("autoreconf --install");
        configure("./", NULL);
        make(NULL);
}
void install(void) {
        make("install");
}
void uninstall(void) {
        make("uninstall");
}
void get_changes(void) {
        // Pull in changes if update() returns 1
}

FORGE_GLOBAL pkg package = {
        .name = getname,
        .ver = getver,
        .desc = getdesc,
        .deps = NULL,
        .download = download,
        .build = build,
        .install = install,
        .uninstall = uninstall,
        .update = forge_pkg_git_update, // using default git update

        // Make this NULL to just re-download the source code
        // or define your own if not using git
        .get_changes = forge_pkg_git_pull,
};
</pre>
</div>

<p>
I have decided to get rid of the <code>update()</code> function because, since this is a <code>git</code> repo, we can use
the <code>forge_pkg_git_update()</code> provided by <code>forge/pkg.h</code> (included by <code>forge/forge.h</code>). If you were to
create your own <code>update()</code> function, it must return <code>1</code> if it should get the new changes and rebuild,
and <code>0</code> if otherwise.
</p>

<p>
If you do not know any of the other functions that are being used i.e., <code>cmd()</code>, <code>make()</code>, <code>configure()</code>,
run <code>forge apilist</code> and then <code>forge api &lt;api_name&gt;</code> to see documentation.
</p>

<p>
Once you are done with your package, call <code>forge --rebuild # or forge -r</code> to rebuild all
<code>C</code> modules. If there are any errors, they will be reported. If you need to fix anything,
do <code>forge edit &lt;pkgname&gt;</code>.
</p>

<p>
You should now see your new package available by running <code>forge list</code>. To get rid of it, run <code>forge drop &lt;pkgname&gt;</code>.
This will create a backup and you can use <code>forge restore &lt;pkgname&gt;</code> to get it back.
</p>
</div>
</div>
</div>
<div id="outline-container-org5e18d85" class="outline-2">
<h2 id="org5e18d85"><span class="section-number-2">4.</span> Configuring <code>Forge</code></h2>
<div class="outline-text-2" id="text-4">
<p>
The configuration file is compiled with <code>forge</code>, meaning that if you need to edit it, you must also
recompile to get the changes. You can edit it by doing <code>forge editconf</code>. Once your changes are done,
do <code>forge updateforge</code> (this requires an internet connection).
</p>
</div>
</div>
<div id="outline-container-org617243a" class="outline-2">
<h2 id="org617243a"><span class="section-number-2">5.</span> API Reference</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org51b12cc" class="outline-3">
<h3 id="org51b12cc"><span class="section-number-3">5.1.</span> <code>forge/smap.h</code></h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_SMAP_H_INCLUDED
#define FORGE_SMAP_H_INCLUDED

#include &lt;stddef.h&gt;

#define FORGE_SMAP_DEFAULT_TBL_CAPACITY 2048

typedef struct __forge_smap_node {
        char *k; // owns the string
        void *v;
        struct __forge_smap_node *n;
} __forge_smap_node;

typedef struct {
        __forge_smap_node **tbl;
        size_t len; // number of table entries
        size_t cap; // capacity of table
        size_t sz; // how many total nodes
} forge_smap;

/**
 * Returns: a new string map
 * Description: Create a new string map. Make sure to
 *              call forge_smap_destroy() to free memory.
 */
forge_smap forge_smap_create(void);

/**
 * Parameter: map -&gt; the map to insert to
 * Parameter: k   -&gt; the key
 * Parameter: v   -&gt; the value
 * Description: Insert key `k` with value `v` into the map `map`.
 */
void forge_smap_insert(forge_smap *map, const char *k, void *v);

/**
 * Parameter: map -&gt; the map to query
 * Parameter: k   -&gt; the key to check
 * Returns: 1 if found, 0 if otherwise
 * Description: See if the key `k` is inside of the map `map`.
 */
int forge_smap_contains(const forge_smap *map, const char *k);

/**
 * Parameter: map -&gt; the map to get from
 * Parameter: k   -&gt; the key with the associated value
 * Returns: the value of of the key `k`.
 * Description: Get the value that the key `k` is associated with.
 */
void *forge_smap_get(const forge_smap *map, const char *k);

/**
 * Parameter: map -&gt; the map to destroy
 * Description: free()'s all memory that `map` allocates.
 */
void forge_smap_destroy(forge_smap *map);

/**
 * Parameter: map -&gt; the map to iterate
 * Returns: an array of keys (NULL terminated, NULL on failure)
 * Description: Use this function to get all keys inside of
 *              the map. It is guaranteed to be NULL terminated.
 *              The result needs to be free()'d. The individual strings
 *              do not need to be free()'d.
 */
char **forge_smap_iter(const forge_smap *map);

/**
 * Paramter: map -&gt; the map to get the size from
 * Returns: the number of nodes in the map
 * Description: Get the number of nodes stored inside of `map`.
 */
size_t forge_smap_size(const forge_smap *map);

#endif // FORGE_SMAP_H_INCLUDED


</pre>
</div>
</div>
</div>
