index.html
<div id="outline-container-org66164f6" class="outline-3">
<h3 id="org66164f6"><span class="section-number-3">5.2.</span> <code>forge/arg.h</code></h3>
<div class="outline-text-3" id="text-5-2">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_ARG_H_INCLUDED
#define FORGE_ARG_H_INCLUDED

#include &lt;stddef.h&gt;

typedef struct forge_arg {
        // Points to the start of the argument
        // after any hyphens (max 2).
        char *s;

        // The number of hyphens (max 2).
        size_t h;

        // Points to the character after the
        // first equals is encountered.
        char *eq;

        // The next argument
        struct forge_arg *n;
} forge_arg;

/**
 * Parameter: argc       -&gt; number of args
 * Parameter: argv       -&gt; actual args
 * Parameter: skip_first -&gt; skip the first arg
 * Returns: linked list of `forge_arg`s
 * Description: Create a list of args that you can
 *              query. The `skip_first` parameter is there
 *              if you do not want the program name to appear
 *              in the linked list. Also, you should always have
 *              a copy to the head of this list for `forge_arg_free()`.
 */
forge_arg *forge_arg_alloc(
        int    argc,
        char **argv,
        int    skip_first
);

/**
 * Parameter: arg -&gt; the pointer to the start of the arg list
 * Description: Free all memory allocated for the linked
 *              list of forge_args. This function should
 *              take the head of a linked list.
 */
void forge_arg_free(forge_arg *arg);

#endif // FORGE_ARG_H_INCLUDED


</pre>
</div>
</div>
</div>
<div id="outline-container-org7cd393f" class="outline-3">
<h3 id="org7cd393f"><span class="section-number-3">5.3.</span> <code>forge/rdln.h</code></h3>
<div class="outline-text-3" id="text-5-3">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_RDLN_H_INCLUDED
#define FORGE_RDLN_H_INCLUDED

char *forge_rdln(const char *prompt);

#endif // FORGE_RDLN_H_INCLUDED


</pre>
</div>
</div>
</div>
<div id="outline-container-orgf664a41" class="outline-3">
<h3 id="orgf664a41"><span class="section-number-3">5.4.</span> <code>forge/forge.h</code></h3>
<div class="outline-text-3" id="text-5-4">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_FORGE_H_INCLUDED
#define FORGE_FORGE_H_INCLUDED

#include "forge/pkg.h"
#include "forge/cmd.h"
#include "forge/str.h"
#include "forge/array.h"
#include "forge/io.h"
#include "forge/smap.h"
#include "forge/viewer.h"
#include "forge/colors.h"
#include "forge/mem.h"
#include "forge/ctrl.h"
#include "forge/rdln.h"
#include "forge/arg.h"
#include "forge/conf.h"

/**
 * This file is solely used for including all
 * API headers. Nothing else should be added here!
 */

#endif // FORGE_FORGE_H_INCLUDED


</pre>
</div>
</div>
</div>
<div id="outline-container-org7fd2e2b" class="outline-3">
<h3 id="org7fd2e2b"><span class="section-number-3">5.5.</span> <code>forge/pkg.h</code></h3>
<div class="outline-text-3" id="text-5-5">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_PKG_H_INCLUDED
#define FORGE_PKG_H_INCLUDED

#include &lt;stddef.h&gt;

#define FORGE_GLOBAL __attribute__((visibility("default")))

typedef struct {
        char *(*name)(void);
        char *(*ver)(void);
        char *(*desc)(void);
        char **(*deps)(void);
        char *(*download)(void);
        void (*build)(void);
        void (*install)(void);
        void (*uninstall)(void);
        int (*update)(void);
        void (*get_changes)(void);
} pkg;

/**
 * Returns: 1 if it should re-download the package,
 *          or 0 if it shouldn't.
 * Description: Performs the built-in way of doing
 *              an update if the package uses git.
 */
int forge_pkg_git_update(void);

/**
 * Description: Performs the built-in way of pulling
 *              changes if a package uses git.
 */
void forge_pkg_git_pull(void);

/**
 * Description: Used in the .update part of the pkg struct.
 *              Use this if you want to notify that updates
 *              need manual checking.
 */
#define forge_pkg_update_manual_check NULL

/**
 * Description: Used in the .get_changes part of the pkg struct.
 *              Use this if you want to completely redownload
 *              the source code to get the new changes.
 */
#define forge_pkg_get_changes_redownload NULL

#endif // FORGE_PKG_H_INCLUDED


</pre>
</div>
</div>
</div>
<div id="outline-container-org0fb4f11" class="outline-3">
<h3 id="org0fb4f11"><span class="section-number-3">5.6.</span> <code>forge/io.h</code></h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_IO_H_INCLUDED
#define FORGE_IO_H_INCLUDED

/**
 * Parameter: fp -&gt; the filepath
 * Returns: 1 if exists, 0 if not exists
 * Description: Checks if the filepath `fp` exists.
 */
int forge_io_filepath_exists(const char *fp);

/**
 * Parameter: fp              -&gt; the filepath
 * Parameter: force_overwrite -&gt; should we overwrite the file
 *                               even if it exists?
 * Description: Create a file at `fp`. If `force_overwrite` is
 *              set to 1, it will truncate the file if it exists.
 */
void forge_io_create_file(const char *fp, int force_overwrite);

/**
 * Parameter: fp -&gt; the filepath
 * Returns: the bytes of the file
 * Description: Read all bytes at the filepath `fp`.
 */
char *forge_io_read_file_to_cstr(const char *fp);

/**
 * Parameter: fp -&gt; the filepath
 * Returns: lines of the file, end of the array is guaranteed
 *          to be NULL.
 * Description: Read all lines at the filepath `fp`.
 */
char **forge_io_read_file_to_lines(const char *fp);

/**
 * Parameter: fp -&gt; the filepath
 * Returns: the absolute filepath of `fp`
 * Description: Get the absolute path of `fp`.
 */
char *forge_io_resolve_absolute_path(const char *fp);

/**
 * Parameter: fp      -&gt; the filepath
 * Parameter: content -&gt; the bytes to write to `fp`
 * Returns: 1 on success, 0 on failure
 * Description: Write `content` to `fp`.
 */
int forge_io_write_file(const char *fp, const char *content);

/**
 * Parameter: fp      -&gt; the filepath
 * Parameter: lines   -&gt; the lines to write
 * Parameter: lines_n -&gt; how many lines to write
 * Returns: 1 on success, 0 on failure
 * Description: Write `lines_n` lines from `lines` to the filepath `fp`.
 */
int forge_io_write_lines(
        const char *fp,
        const char **lines,
        size_t lines_n
);

/**
 * Parameter: path -&gt; the filepath to check
 * Returns: 1 if it is a directory, and 0 if not
 * Description: Check if `path` is a directory.
 */
int forge_io_is_dir(const char *path);

/**
 * Parameter: dir      -&gt; the directory to search
 * Parameter: filename -&gt; the file to search for
 * Returns: 1 if found, and 0 if otherwise
 * Description: Checks to see if `dir` contains `filename`.
 */
int forge_io_dir_contains_file(const char *dir, const char *filename);

/**
 * Parameter: path -&gt; the path to extract the basename from
 * Returns: the basename
 * Description: Given some path i.e., `/home/user/dev/main.c`,
 *              will extract the basename `main.c` from the path.
 */
const char *forge_io_basename(const char *path);

/**
 * Parameter: path -&gt; the directory to remove
 * Return: 1 on success, and 0 on failure.
 * Description: Remove the directory `path`.
 */
int forge_io_rm_dir(const char *path);

#endif // FORGE_IO_H_INCLUDED


</pre>
</div>
</div>
</div>
