index.html
<div id="outline-container-org5de112d" class="outline-3">
<h3 id="org5de112d"><span class="section-number-3">5.7.</span> <code>forge/str.h</code></h3>
<div class="outline-text-3" id="text-5-7">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_STR_H_INCLUDED
#define FORGE_STR_H_INCLUDED

typedef struct {
        char *data;
        size_t len, cap;
} forge_str;

/**
 * Returns: an empty forge_str
 * Description: Create a new empty forge_str.
 */
forge_str forge_str_create(void);

/**
 * Parameter: s -&gt; the string to create from
 * Returns: a new forge_str created from `s`.
 * Description: Creates a new forge_str with the
 *              content of `s`.
 */
forge_str forge_str_from(const char *s);

/**
 * Parameter: s -&gt; the string to take from
 * Returns: a new forge_str created from `s`.
 * Description: Creates a new forge_str with the
 *              content of `s`. It will take ownership
 *              of the pointer so it will be destroyed
 *              in `forge_str_destroy()`.
 */
forge_str forge_str_take(char *s);

/**
 * Parameter: fs -&gt; the forge_str
 * Description: Clear the string `fs`.
 */
void forge_str_clear(forge_str *fs);

/**
 * Parameter: fs -&gt; the forge_str
 * Description: free() all memory associated with `fs`. This also
                resets all other members of `fs` so it can be re-used.
 */
void forge_str_destroy(forge_str *fs);

/**
 * Parameter: fs -&gt; the forge_str to append to
 * Parameter: c  -&gt; the character to append
 * Description: Append the character `c` to `fs`.
 */
void forge_str_append(forge_str *fs, char c);

/**
 * Parameter: fs -&gt; the forge_str to concat to
 * Parameter: s -&gt; the string to concat
 * Description: Concatinate `s` to `fs`.
 */
void forge_str_concat(forge_str *fs, const char *s);

/**
 * Paramter: s0 -&gt; the first forge_str
 * Paramter: s1 -&gt; the second forge_str
 * Returns: 1 if they are equal, and 0 if otherwise
 * Description: Check if s0 == s1.
 */
int forge_str_eq(const forge_str *s0, const forge_str *s1);

/**
 * Parameter: s0 -&gt; the forge_str
 * Parameter: s1 -&gt; the c_str
 * Returns: 1 if they are equal, and 0 if otherwise
 * Description: Checks if s0.data == s1.
 */
int forge_str_eq_cstr(const forge_str *s0, const char *s1);

/**
 * Parameter: fs -&gt; the forge_str
 * Returns: the c_str of `fs`
 * Description: Get the underlying c_str data of `fs`.
 */
char *forge_str_to_cstr(const forge_str *fs);

/**
 * Parameter: fs             -&gt; the forge_str to search in
 * Parameter: substr         -&gt; the substring to search
 * Parameter: case_sensitive -&gt; whether it should be case sensitive
 * Returns: a pointer to the start of the substring if found,
 *          or NULL if not found
 * Description: Check `fs` for substring `substr`.
 */
char *forge_str_contains_substr(
        const forge_str *fs,
        const char *substr,
        int case_sensitive
);

/**
 * Parameter: fs  -&gt; the forge_str to insert into
 * Parameter: c   -&gt; the character to insert
 * Parameter: idx -&gt; the index to insert at
 * Description: Insert character `c` into string `fs` at index `idx`.
 */
void forge_str_insert_at(forge_str *fs, char c, size_t idx);

/**
 * Parameter: first -&gt; the first string
 * VARIADIC         -&gt; other strings
 * Returns: the concatination of all strings
 * Description: Build a string of the variadic parameters.
 *              Note: Remember to put NULL as the last argument!
 */
char *forge_str_builder(const char *first, ...);

/**
 * Parameter: fs -&gt; the forge_string
 * Returns: the character that was removed
 * Description: Pop's the last character off of
 *              the string `fs`. It is up to you
 *              to make sure that `fs.len &gt; 0`.
 */
char forge_str_pop(forge_str *fs);

char forge_str_rm_at(forge_str *fs, size_t idx);

#endif // FORGE_STR_H_INCLUDED


</pre>
</div>
</div>
</div>
