index.html
<div id="outline-container-orgb729a57" class="outline-3">
<h3 id="orgb729a57"><span class="section-number-3">5.8.</span> <code>forge/cmd.h</code></h3>
<div class="outline-text-3" id="text-5-8">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_CMD_H_INCLUDED
#define FORGE_CMD_H_INCLUDED

/**
 * Returns: the current working directory
 * Description: Gets the current working directory or NULL on failure.
 */
char *cwd(void);

/**
 * Parameter: fp -&gt; the filepath to cd into
 * Returns: 1 on success, 0 on failure
 * Description: cd into the filepath `fp`.
 */
int cd(const char *fp);

/**
 * Parameter: fp -&gt; the filepath to cd into
 * Returns: 1 on success, 0 on failure
 * Description: the same as cd(), but silent.
 */
int cd_silent(const char *fp);

/**
 * Parameter: cmd -&gt; the command to execute
 * Returns: 1 on success, 0 on failure
 * Description: Issue a BASH command.
 */
int cmd(const char *cmd);

/**
 * Parameter: cmd      -&gt; the command to execute
 * Parameter: username -&gt; the user to execute the command as
 * Returns: 1 on success, 0 on failure
 * Description: Issue a BASH command as a specific user.
 *              This is useful if the program is being ran
 *              through `sudo` and you need to create some
 *              files not in /root/. It might be useful to
 *              call get_prev_user() to get the user that
 *              ran forge through sudo.
 */
int cmd_as(const char *cmd, const char *username);

/**
 * Parameter: cmd -&gt; the command to execute
 * Returns: the output of the command, or NULL on failure
 * Description: Issue a BASH command and capture the output.
 *              If the command fails or something goes wrong,
 *              return return result will be NULL.
 */
char *cmdout(const char *cmd);

/**
 * Parameter: author -&gt; the author of the program
 * Parameter: name   -&gt; the name of the program
 * Returns: the name of the program
 * Description: Do a `git clone https://www.github.com/&lt;author&gt;/&lt;name&gt;.git`.
 *              This function returns the name of the command as it is
 *              convenient for the download() function in the C modules.
 */
char *git_clone(char *author, char *name);

/**
 * Parameter: fp -&gt; the filepath to create
 * Returns: the filepath, or NULL on failure
 * Description: Create a directory with the `-p` flag.
 */
char *mkdirp(char *fp);

/**
 * Parameter: var -&gt; the environment variable
 * Returns: the value of the environment variable, or NULL on failure
 * Description: Get the value of an environment variable. Do not
 *              include the dollarsign ($) in the variable name.
 */
char *env(const char *var);

/**
 * Returns: the username of the previous user
 * Description: Get the username of the previous user
 *              calling forge. For example, if forge was
 *              ran as: `USER@/bin/sh# sudo forge install ...`, then the
 *              result will be USER.
 */
char *get_prev_user(void);

/**
 * Parameter: path -&gt; the path to the file to change
 * Parameter: user -&gt; the user to give ownership to
 * Returns: 1 on success, or 0 on failure
 * Description: Change the ownership of `path` to `user`.
 */
int change_file_owner(const char *path, const char *user);

/**
 * Parameter: type? -&gt; the type of make we are doing
 * Returns: 1 on success, or 0 on failure
 * Description: Performs `make &lt;type&gt;` and utilizes
 * macros in conf.h. If `type` is NULL, it will just
 * call `make`.
 */
int make(const char *type);

/**
 * Parameter: flags -&gt; the flags to pass to configure
 * Parameter: fp?   -&gt; the path to configure
 * Returns: 1 on success, or 0 on failure
 * Description: Performs `&lt;fp&gt;configure &lt;flags&gt;` and utilizes
 * macros in conf.h. Make sure to include the last '/' in `fp`!
 */
int configure(const char *fp, const char *flags);

/**
 * Paramater: dir -&gt; the dir to perform `ls` on
 * Returns: an array of all files found in `dir`.
 * Description: Perform `ls` on `dir`. Collects all files
 *              found and returns them in an array. The end
 *              of the array is guaranteed to be NULL terminated.
 *              If something goes wrong, the return result will be NULL.
 *              All entries of the array must be free()'d, and the
 *              array itself must be free()'d.
 */
char **ls(const char *dir);

/**
 * Paramter: path -&gt; the path to check
 * Returns: 1 if `path` is a git directory, and 0 if otherwise
 * Description: Check if `path` is a git directory.
 */
int is_git_dir(const char *path);

#endif // FORGE_CMD_H_INCLUDED


</pre>
</div>
</div>
</div>
<div id="outline-container-org11f8ff0" class="outline-3">
<h3 id="org11f8ff0"><span class="section-number-3">5.9.</span> <code>forge/colors.h</code></h3>
<div class="outline-text-3" id="text-5-9">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_COLORS_H_INCLUDED
#define FORGE_COLORS_H_INCLUDED

#define YELLOW               "\033[93m"
#define GREEN                "\033[32m"
#define BRIGHT_GREEN         "\033[92m"
#define GRAY                 "\033[90m"
#define RED                  "\033[31m"
#define BLUE                 "\033[94m"
#define CYAN                 "\033[96m"
#define MAGENTA              "\033[95m"
#define WHITE                "\033[97m"
#define BLACK                "\033[30m"
#define CYAN                 "\033[96m"
#define PINK                 "\033[95m"
#define BRIGHT_PINK          "\033[38;5;213m"
#define PURPLE               "\033[35m"
#define BRIGHT_PURPLE        "\033[95m"
#define ORANGE               "\033[38;5;214m"
#define BROWN                "\033[38;5;94m"

#define UNDERLINE            "\033[4m"
#define BOLD                 "\033[1m"
#define ITALIC               "\033[3m"
#define DIM                  "\033[2m"
#define INVERT               "\033[7m"
#define RESET                "\033[0m"

char *forge_colors_c_to_string(const char *s);

#endif // FORGE_COLORS_H_INCLUDED


</pre>
</div>
</div>
</div>
<div id="outline-container-org648d3a6" class="outline-3">
<h3 id="org648d3a6"><span class="section-number-3">5.10.</span> <code>forge/mem.h</code></h3>
<div class="outline-text-3" id="text-5-10">
<div class="org-src-container">
<pre class="src src-c">#ifndef FORGE_MEM_H_INCLUDED
#define FORGE_MEM_H_INCLUDED

#include &lt;stdint.h&gt;

void *forge_mem_malloc(size_t nbytes);

#endif // FORGE_MEM_H_INCLUDED


</pre>
</div>
</div>
</div>
