index.org
** =forge/ctrl.h=
#+begin_src c
#ifndef FORGE_CTRL_H_INCLUDED
#define FORGE_CTRL_H_INCLUDED

#include <termios.h>

#define CTRL_A 1
#define CTRL_B 2
#define CTRL_C 3
#define CTRL_D 4
#define CTRL_E 5
#define CTRL_F 6
#define CTRL_G 7
#define CTRL_H 8
#define CTRL_I 9
#define CTRL_J 10
#define CTRL_K 11
#define CTRL_L 12
#define CTRL_M 13
#define CTRL_N 14
#define CTRL_O 15
#define CTRL_P 16
#define CTRL_Q 17
#define CTRL_R 18
#define CTRL_S 19
#define CTRL_T 20
#define CTRL_U 21
#define CTRL_V 22
#define CTRL_W 23
#define CTRL_X 24
#define CTRL_Y 25
#define CTRL_Z 26

#define UP_ARROW    'A'
#define DOWN_ARROW  'B'
#define RIGHT_ARROW 'C'
#define LEFT_ARROW  'D'

/**
 * Parameter: ch -> the character to compare
 * Returns: whether `ch` is a newline
 * Description: Check if `ch` is a newline.
 */
#define ENTER(ch)     ((ch) == '\n')

/**
 * Parameter: ch -> the character to compare
 * Returns: whether `ch` is a backspace
 * Description: Check if `ch` is a backspace.
 */
#define BACKSPACE(ch) ((ch) == 8 || (ch) == 127)

/**
 * Parameter: ch -> the character to compare
 * Returns: whether `ch` is a tab
 * Description: Check if `ch` is a tab.
 */
#define TAB(ch)       ((ch) == '\t')

/**
 * Parameter: ch -> the character to compare
 * Returns: whether `ch` is an escape sequence
 * Description: Check if `ch` is an escape sequence.
 */
#define ESCSEQ(ch)    ((ch) == 27)

/**
 * Parameter: ch -> the character to compare
 * Returns: whether `ch` is a control sequence
 * Description: Check if `ch` is a control sequence.
 */
#define CSI(ch)       ((ch) == '[')

#define CURSOR_LEFT(n)  printf("\033[%dD", n);
#define CURSOR_RIGHT(n) printf("\033[%dC", n);
#define CURSOR_UP(n)    printf("\033[%dA", n);
#define CURSOR_DOWN(n)  printf("\033[%dB", n);

typedef enum {
    USER_INPUT_TYPE_CTRL,
    USER_INPUT_TYPE_ALT,
    USER_INPUT_TYPE_ARROW,
    USER_INPUT_TYPE_SHIFT_ARROW,
    USER_INPUT_TYPE_NORMAL,
    USER_INPUT_TYPE_UNKNOWN,
} forge_ctrl_input_type;

/**
 * Parameter: fd          -> the file descriptor
 * Parameter: old_termios -> the termios to copy bits from
 * Returns: 1 on success, 0 on failure
 * Description: Enable the terminal raw mode. This disables the bits:
 *                  ECHO
 *                  ICANON
 *                  IXON.
 *              Note: If working with stdin, `fd` should be STDIN_FILENO.
 */
int forge_ctrl_enable_raw_terminal(int fd, struct termios *old_termios);

/**
 * Parameter: fd          -> the file descriptor
 * Parameter: old_termios -> the termios to copy bits from
 * Returns: 1 on success, 0 on failure
 * Description: Disables the terminal raw mode. The old termios
 *              should have the same memory address as the termios
 *              passed to `forge_ctrl_enable_raw_terminal()`.
 */
int forge_ctrl_disable_raw_terminal(int fd, struct termios *old_termios);

/**
 * Parameter: c -> the character to store to
 * Returns: the type of input the user entered
 * Description: Will read input from the user. The type of that
 *              input will be the return type (see enum forge_ctrl_input_type)
 *              and the actual byte data will be inside of `c`.
 */
forge_ctrl_input_type forge_ctrl_get_input(char *c);

/**
 * Description: Clear the terminal.
 */
void forge_ctrl_clear_terminal(void);

/**
 * Description: Clear the current line.
 */
void forge_ctrl_clear_line(void);

/**
 * Parameter: n -> the column number
 * Description: Move the cursor to column `n`.
 */
void forge_ctrl_cursor_to_col(int n);

#endif // FORGE_CTRL_H_INCLUDED


#+end_src
** =forge/viewer.h=
#+begin_src c
#ifndef FORGE_VIEWER_H_INCLUDED
#define FORGE_VIEWER_H_INCLUDED

#include <termios.h>

typedef struct {
        char **data;
        size_t rows;
        size_t cols;
        size_t win_width;
        size_t win_height;
        size_t height_offset;
        struct termios old_termios;

        struct {
                int mode;
                char *buffer;
                size_t len;
                size_t cap;
                // Last search query
                char *last;
        } search;

        struct {
                // array of matching row indices
                size_t *matches;
                size_t count;
                size_t cap;
                size_t current;
        } match;
} forge_viewer;

/**
 * Parameter: data   -> the lines to put into the viewer
 * Parameter: data_n -> the number of lines in `data`
 * Returns: a new forge_viewer
 * Description: Create a new forge_viewer of `data` (copied),
 *              `data_n` lines long. No need to free()
 *              `data`.
 */
forge_viewer *forge_viewer_alloc(char **data, size_t data_n);

/**
 * Parameter: v -> the viewer
 * Description: free() all memory used by the viewer
 */
void forge_viewer_free(forge_viewer *v);

/**
 * Parameter: v -> the viewer
 * Description: Display all lines in the viewer.
 *              This opens a `less`-like viewer.
 */
void forge_viewer_display(forge_viewer *v);

#endif // FORGE_VIEWER_H_INCLUDED


#+end_src
** =forge/conf.h=
#+begin_src c
#ifndef FORGE_CONF_H_INCLUDED
#define FORGE_CONF_H_INCLUDED

#define FORGE_PREFERRED_MAKEFILE_JFLAGS "$(nproc)"

#define FORGE_PREFERRED_INSTALL_PREFIX "/usr/local"

#define FORGE_PREFERRED_LIB_PREFIX "/usr/local/lib64"

#define FORGE_EDITOR "vim"

#endif // FORGE_CONF_H_INCLUDED


#+end_src
